#### MaterialAspect Enumeration

---

|  |
| --- |
| See Also |

A list of all material aspects that a material can store PropertySetElements for.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public enum MaterialAspect ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration MaterialAspect ``` |

| Visual C++ |
| --- |
| ``` public enum class MaterialAspect ``` |

# Members

| Member name | Description |
| --- | --- |
| Structural | Structural |
| Thermal | Thermal |

# See Also

Autodesk.Revit.DB Namespace